In [5]:
import pandas as pd
import os

pd.set_option('display.max_column', None)

In [6]:
analize_data = pd.read_csv("train.csv")

In [7]:
analize_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S
3,3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,NaN,S
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S

In [8]:
analize_data["Sex"].head()

0    male
1    male
2    male
3    male
4    male
Name: Sex, dtype: object

In [12]:
analize_data["Sex"].groupby(analize_data["Sex"])

In [13]:
analize_data["Sex"].groupby(analize_data["Sex"])

In [14]:
analize_data["Age"].max()

87.0

In [18]:
analize_data[analize_data["Age"]=='NaN'].count()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [17]:
analize_data["Age"].mean()

C:\Users\Dmitry\AppData\Local\Temp/ipykernel_4936/2618198892.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  analize_data.mean()

PassengerId    49999.500000
Survived           0.427740
Pclass             2.106910
Age               38.355472
SibSp              0.397690
Parch              0.454560
Fare              43.929330
dtype: float64

In [21]:
analize_data[analize_data["Cabin"]=='NaN'].count()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [22]:
analize_data[analize_data["Pclass"]==0].count()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [23]:
analize_data[analize_data["Pclass"]==1].count()

PassengerId    30315
Survived       30315
Pclass         30315
Name           30315
Sex            30315
Age            29353
SibSp          30315
Parch          30315
Ticket         30288
Fare           30275
Cabin          26463
Embarked       30229
dtype: int64

In [24]:
analize_data[analize_data["Pclass"]==2].count()

PassengerId    28679
Survived       28679
Pclass         28679
Name           28679
Sex            28679
Age            27731
SibSp          28679
Parch          28679
Ticket         27855
Fare           28637
Cabin           3520
Embarked       28609
dtype: int64

In [25]:
analize_data[analize_data["Pclass"]==3].count()

PassengerId    41006
Survived       41006
Pclass         41006
Name           41006
Sex            41006
Age            39624
SibSp          41006
Parch          41006
Ticket         37234
Fare           40954
Cabin           2151
Embarked       40912
dtype: int64

In [26]:
analize_data[analize_data["Pclass"]==4].count()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [28]:
analize_data[analize_data["Pclass"]==3].head(25)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S
3,3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,NaN,S
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S
6,6,0,3,"Conway, Jose",male,7.00,0,0,A/5,9.77,NaN,S
7,7,1,3,"Werner, Linda",female,6.00,1,2,434426,31.50,NaN,S
10,10,0,3,"Nichols, William",male,31.00,0,0,459690,8.06,NaN,S
12,12,0,3,"Stewart, Pat",male,36.00,0,0,434108,9.34,C8674,S
15,15,1,3,"Estrada, Nancy",female,57.00,0,0,A/S 53862,9.31,NaN,S
16,16,0,3,"Feller, Jimmie",male,53.00,0,0,NaN,7.92,NaN,S
20,20,0,3,"Lim, Tiana",female,17.00,0,0,A. 38515,8.28,NaN,S
23,23,1,3,"Brown, Pat",female,23.00,0,0,428754,7.95,NaN,Q
24,24,0,3,"Fetterolf, Andy",male,21.00,0,0,433460,10.38,NaN,S
26,26,0,3,"Liang, Amanda",female,26.00,0,0,A. 12030,10.24,NaN,S
29,29,0,3,"Robinson, James",male,36.00,0,0,419996,8.60,NaN,S
30,30,1,3,"Escareno, William",male,5.00,1,1,14288,31.35,NaN,S
31,31,1,3,"Hollander, Richard",male,7.00,1,0,NaN,28.75,NaN,S
35,35,0,3,"Hall, Booker",male,NaN,0,0,422605,5.77,NaN,C
41,41,1,3,"Dixon, Ray",male,22.00,0,0,12720,6.03,NaN,S
44,44,0,3,"Hickey, Gregory",male,NaN,1,0,11059,27.49,NaN,S
45,45,0,3,"Gallagher, Theresa",female,68.00,0,1,SC/PARIS 11177,31.01,NaN,C
46,46,0,3,"Bennett, Christopher",male,71.00,0,0,318079,25.60,NaN,C
49,49,0,3,"Sohn, Shane",male,22.00,0,3,A. 440907,9.29,NaN,Q
55,55,0,3,"Persad, Elbert",male,3.00,1,2,424265,80.84,NaN,S
58,58,0,3,"Olsson, Aaron",male,37.00,0,0,14214,10.46,NaN,S

In [32]:
analize_data[(analize_data["Pclass"]==3)&((analize_data["Cabin"]))].count()

PassengerId    2151
Survived       2151
Pclass         2151
Name           2151
Sex            2151
Age            2076
SibSp          2151
Parch          2151
Ticket         2105
Fare           2147
Cabin          2151
Embarked       2144
dtype: int64

In [35]:
analize_data[(analize_data["Pclass"]==3)&((analize_data["Cabin"]))&((analize_data["Age"]>0))].count()

PassengerId    2076
Survived       2076
Pclass         2076
Name           2076
Sex            2076
Age            2076
SibSp          2076
Parch          2076
Ticket         2032
Fare           2072
Cabin          2076
Embarked       2069
dtype: int64

In [36]:
analize_data[(analize_data["Pclass"]==3)&((analize_data["Cabin"]))&((analize_data["Age"]>0))].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,12,0,3,"Stewart, Pat",male,36.0,0,0,434108,9.34,C8674,S
94,94,1,3,"Level, Tammara",female,59.0,0,0,10156,24.93,C11610,C
165,165,1,3,"Troxel, Barbara",female,62.0,0,0,440065,30.29,F2767,C
170,170,1,3,"Mahr, Patsy",female,29.0,0,0,345263,28.06,E7752,C
232,232,1,3,"Plowden, Joni",female,28.0,0,0,26696,29.88,D9019,C

In [37]:
analize_data[(analize_data["Pclass"]==3)&((analize_data["Cabin"]))&((analize_data["Age"]>0))]['Age'].min()

0.17

In [38]:
analize_data[(analize_data["Pclass"]==3)&((analize_data["Cabin"]))&((analize_data["Age"]>0))]['Age'].max()

85.0

In [39]:
analize_data[(analize_data["Pclass"]==3)&((analize_data["Cabin"]))&((analize_data["Age"]>0))]['Age'].mean()

39.441594412331405